export const FAQ_DATA = [
  {
    id: '1',
    question: 'Чи можу я забрати тварину з іншого міста ? ',
    answer:
      'Так! Багато притулків допомагають з перевезенням. Умови транспортування Ви зможете узгодити з конкретним притулком.',
  },
  {
    id: '2',
    question: 'Чи всі тварини вакциновані та стерилізовані ?',
    answer:
      'Так, більшість. У картці кожної тварини ви знайдете інформацію про щеплення, здоров’я та стерилізацію. Якщо щось ще в процесі, притулок обов’язково підкаже.',
  },
  {
    id: '3',
    question: 'Які документи потрібні для адопції ?',
    answer:
      'Зазвичай тільки паспорт і підписання простого договору. Це допомагає захистити і вас, і тварину.',
  },
  {
    id: '4',
    question: 'Чи можна приїхати й познайомитися з твариною ?',
    answer:
      'Звісно! Притулки завжди раді гостям. Приїжджайте, щоб погладити, обійняти і відчути, чи це саме ваш друг.',
  },
  {
    id: '5',
    question: 'А якщо не вийде і доведеться повернути тварину ?',
    answer:
      'Таке буває, і нічого страшного. Притулки приймуть тварину назад, щоб вона не опинилася на вулиці. Важливо спробувати і дати шанс.',
  },
  {
    id: '6',
    question: 'Як допомогти, якщо я не готовий усиновлювати ?',
    answer:
      'Є багато способів! Можна стати волонтером, допомогти з кормом чи донатом. Будь-яка допомога дуже цінна',
  },
];
