import HappyStoryImg1 from '../assets/images/happy_stories/djeck.webp';
import HappyStoryImg2 from '../assets/images/happy_stories/Richi.webp';
import HappyStoryImg3 from '../assets/images/happy_stories/Roksi.webp';
import HappyStoryImg4 from '../assets/images/happy_stories/Chara.webp';

export const HAPPY_STORIES_DATA = [
  {
    src: HappyStoryImg1,
    name: 'Джек',
    description: [
      'Джек потрапив до притулку ще цуценям - зворушливо лагідний, але трохи полохливий. Він завжди чекав біля вікна, дивлячись на вулицю, ніби шукав свою людину.',
      'Його фото побачив 30-річний хлопець на ім’я Андрій. Він не планував брати собаку, але в очах Джека було щось особливе, стався метч. Вже наступного дня Андрій приїхав до притулку, і коли Барсик одразу стрибнув йому на руки - все стало зрозуміло.',
      'Тепер Барсик має свій дім, улюблену ковдру й ранкові обійми. А Андрій каже, що це найкраще рішення в його житті.',
    ],
  },
  {
    src: HappyStoryImg2,
    name: 'Роксі',
    description: [
      'Роксі була колись домашньою, але потрапила до притулку після переїзду своїх попередніх господарів. Спочатку вона не довіряла нікому й ховалася в будиночку.',
      'До притулку прийшла сім’я з двома дітьми — Марко і Софійка. Вони хотіли знайти лагідну кішку, яка подружиться з дітьми. Марко тихенько підсунув до Роксі мисочку з кормом, і вона обережно вийшла, щоб потертися об його руку.',
      'Тепер Роксі спить у ногах у дітей, ганяється за іграшками та любить дивитися з вікна на пташок. А мама родини каже, що з її появою в домі стало більше тепла й сміху.',
    ],
  },
  {
    src: HappyStoryImg3,
    name: 'Річі',
    description: [
      'Річі потрапив до притулку після того, як його залишили колишні власники. Він був енергійним, але дуже слухняним і з вдячністю реагував на будь-яку увагу.',
      'Одного разу притулок відвідала родина з 5-річним хлопчиком Артемом. Хлопчик трохи боявся собак, але Річі просто сів поруч і обережно поклав голову на його коліна. Страх зник за кілька хвилин.',
      'Тепер Артем і Річі нерозлучні: вони грають у дворі, разом ходять у школу (Річі чекає за воротами) і навіть засинають поруч на дивані після вечірніх мультфільмів.',
    ],
  },
  {
    src: HappyStoryImg4,
    name: 'Чара',
    description: [
      'Чару знайшли на вулиці взимку - худу, замерзлу, з пошкодженою лапкою. У притулку її виходили, але вона все одно ховалася від людей.',
      'Ірина, яка нещодавно переїхала у нову квартиру, відчула, що їй бракує тепла. Вона вирішила дати шанс саме тій тварині, яку беруть найрідше. Коли вона вперше взяла Чару на руки, кішка тремтіла, але вже вдома почала тихо муркотіти.',
      'Сьогодні Чара спить на подушці поруч з Іриною, а в їхній квартирі пахне свіжозавареним чаєм і відчувається справжній затишок.',
    ],
  },
];
