import { AnswerItem } from '../components/AccordionItem/AccordionItem';
export interface FAQItem {
  id: string;
  question: string;
  answer: string | AnswerItem[];
}

export const SHELTERS_FAQ_DATA: FAQItem[] = [
  {
    id: '1',
    question: 'Як розмістити тварину на платформі?',
    answer:
      'Ви додаєте фото, короткий опис та вибираєте характеристики тварини з готових тегів. Після цього тварина з’являється на платформі для потенційних власників.',
  },
  {
    id: '2',
    question:
      'Іноді майбутні власники хочуть всиновити тваринку, але не готові до відповідальності. Як дізнатися чи наш хвостик знайде свого ідеального власника?',
    answer:
      'Наша платформа збирає анкету від потенційного власника та передає її вашому притулку. Ви переглядаєте всі відповіді й приймаєте остаточне рішення про всиновлення.',
  },
  {
    id: '3',
    question: 'Як отримувати допомогу та донати? ',
    answer:
      'Платформа дозволяє безпечно отримувати донати від користувачів. Всі транзакції, заявки на волонтерство та допомогу ліками та кормом ви бачите у своєму кабінеті. ',
  },
  {
    id: '4',
    question:
      'Ми не офіційний притулок, а волонтерська спільнота. Чи можемо працювати через платформу?',
    answer:
      'Так! Ви можете підтвердити свою діяльність через активні сторінки у соцмережах.  Після перевірки ви зможете розміщувати тварин та отримувати донати.',
  },
  {
    id: '5',
    question:
      'Які вимоги до сторінок у соцмережах, якщо ми не офіційний притулок?',
    answer: [
      {
        type: 'list',
        content: [
          'Публічність та відкритий доступ.',
          'Активність: не менше 20 постів за останні 3 місяці.',
          'Реальні фото тварин та чіткий опис діяльності.',
          'Підтверджені факти допомоги.',
        ],
      },
      {
        type: 'text',
        content:
          'Ми перевіряємо контактні дані, сторінки у соцмережах і активність.',
      },
    ],
  },
  {
    id: '6',
    question:
      'Як спростити процес додавання та управління тваринами, якщо у нас мало часу? ',
    answer:
      'Лише під час реєстрації потрібно заповнити анкету та надати документи. Далі все легко та швидко: додаєте фото, короткий опис і обираєте потрібні характеристики тварини з готових тегів.',
  },
  {
    id: '7',
    question: 'Як залучити більше охочих всиновити наших тварин?',
    answer:
      'Ми допомагаємо знаходити надійних власників, але справжній успіх можливий лише разом із вами. Переглядайте заявки у своєму кабінеті, діліться історіями щасливих адопцій, а ми поширюватимемо їх у соцмережах і серед партнерів. Кожна спільна історія наближає нових людей до рішення всиновити!',
  },
];
